{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Количество вершин в графе: 4\n",
      "Максимальное количество ребер у вершины\n",
      "Процент от числа вершин (0, 1.0]: 1\n",
      "Из вершины 0 ребра ведут к вершинам {2}\n",
      "Из вершины 1 ребра ведут к вершинам {0, 2, 3}\n",
      "Из вершины 2 ребра ведут к вершинам {3}\n",
      "Из вершины 3 ребра ведут к вершинам {1}\n",
      "\n",
      "Начальная вершина для поиска (-1 для выхода): 1\n",
      "[1, None, 0, 2]\n",
      "\n",
      "   1;   0;   2;   3;  -3;   2;  -2;   0;   0;   1;\n",
      "  -1;\n",
      "Начальная вершина для поиска (-1 для выхода): 0\n",
      "[None, 3, 0, 2]\n",
      "\n",
      "   0;   2;   3;   1;  -1;   3;  -3;   2;  -2;   0;\n",
      "   0;\n",
      "Начальная вершина для поиска (-1 для выхода): 3\n",
      "[1, 3, 0, None]\n",
      "\n",
      "   3;   1;   0;   2;  -2;   0;   0;   1;  -1;   3;\n",
      "  -3;\n",
      "Начальная вершина для поиска (-1 для выхода): 0\n",
      "[None, 3, 0, 2]\n",
      "\n",
      "   0;   2;   3;   1;  -1;   3;  -3;   2;  -2;   0;\n",
      "   0;\n",
      "Начальная вершина для поиска (-1 для выхода): -1\n"
     ]
    }
   ],
   "source": [
    "# 3. Написать программу, которая обходит не взвешенный ориентированный граф без петель,\n",
    "# в котором все вершины связаны, по алгоритму поиска в глубину (Depth-First Search).\n",
    "# a. граф должен храниться в виде списка смежности;\n",
    "# b. генерация графа выполняется в отдельной функции, которая принимает на вход число вершин.\n",
    "# ----------------------------------------------------------------------------------------------------------------------\n",
    "\n",
    "import random\n",
    "\n",
    "def create_graph(vertex, percent=1.0): # на вход вершину и процент от числа вершин (укажет максимум ребер вершины)\n",
    "    assert 0 < percent <= 1.0, \"Неверный диапазон\"\n",
    "    \n",
    "    graph = {} # графом будет словарь где ключ - вершина, значения - ребра к остальным\n",
    "    \n",
    "    for i in range(vertex): # каждой вершине сооветствуют:\n",
    "        graph[i] = set() # следующие по ребрам уникальные остановки (вершины)\n",
    "        \n",
    "        count_edge = random.randrange(1, int(vertex * percent)) \n",
    "        # случайное значение от 1 до максимума ребер (столько будет ребер у i-той вершины)\n",
    "        \n",
    "        while len(graph[i]) < count_edge:    # проверка того что количество вершин меньше count_edge\n",
    "            edge = random.randrange(0, vertex)        # случайная следующая вершина\n",
    "            if edge != i:         # условие для того чтобы ребро из какой-то вершины не возвращалось к ней же\n",
    "                graph[i].add(edge)       # заполнение ребрами из i-той вершины (в значения словаря)\n",
    "                \n",
    "    return graph   # частично-случайно сгенерированный граф приготовлен\n",
    "\n",
    "\n",
    "def dfs(graph, start):        # сама функция принимает граф и начало пути\n",
    "    path = []                                    # сам путь пока пуст\n",
    "    parent = [None for _ in range(len(graph))]           # список родительских вершин пока пуст\n",
    "    is_visited = [False for _ in range(len(graph))]          # журнал посещаемости вершин пока ложен   \n",
    "    \n",
    "    def _dfs(vertex):                                        # внутренняя функция для посещаемости\n",
    "        is_visited[vertex] = True                            # вершина достигнута\n",
    "        path.append(vertex)                                  # вершина добавлена в список достигнутых вершин\n",
    "        \n",
    "        for item in graph[vertex]:      # перебираем вершины\n",
    "            if not is_visited[item]:       # не посещенные...\n",
    "                parent[item] = vertex        # будут родительскими\n",
    "                _dfs(item)          # рекурсивно к ней применяется функция чтобы идти вглубь\n",
    "                path.append(vertex)      # в список достигнутых добавлена она\n",
    "                \n",
    "        else:\n",
    "            path.append(-vertex)    # если вершина уже посещена, двигаемся на шаг назад\n",
    "                \n",
    "    _dfs(start)         # применяется это все к начальной вершине                                    \n",
    "        \n",
    "    return parent, path    \n",
    "    \n",
    "g = create_graph(int(input('Количество вершин в графе: ')),\n",
    "                float(input('Максимальное количество ребер у вершины\\n'\n",
    "                           'Процент от числа вершин (0, 1.0]: ')))\n",
    "\n",
    "for key, value in g.items():\n",
    "    print(f'Из вершины {key} ребра ведут к вершинам {value}')\n",
    "    \n",
    "\n",
    "while True:\n",
    "    s = int(input('\\nНачальная вершина для поиска (-1 для выхода): '))\n",
    "    \n",
    "    if s == -1:\n",
    "        break\n",
    "    \n",
    "    parent, path = dfs(g, s)        # выносятся из функции к началу s оба вывода\n",
    "    print(parent)\n",
    "    \n",
    "    for i, vertex in enumerate(path):         # оформление\n",
    "        if i % 10 == 0:\n",
    "            print()\n",
    "            \n",
    "        print(f'{vertex:>4};', end='')      "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
